# 06: Mengganti nama (label) kolom pada Data Frame

"Enjelita Meilinda - 2373037"
# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  7  6  3  7  7
1  7  1  5  1  9
2  3  1  1  1  5
3  8  4  3  8  9
4  2  2  4  9  6

# Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [3]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  7  6     3  7  7
1  7  1     5  1  9
2  3  1     1  1  5
3  8  4     3  8  9
4  2  2     4  9  6

# Mengganti nama (label) untuk banyak kolom pada Data Frame

In [4]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     7       6  3     7  7
1     7       1  5     1  9
2     3       1  1     1  5
3     8       4  3     8  9
4     2       2  4     9  6